# Вычислить число Пи c заданной точностью d
# Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$


d = int(input('Введите точность: '))
n = 0
s1 = 0
s2 = 0

for i in range(d):
    n += 1
    s1 = s2 + 4 / (2 * n - 1)
    n += 1
    s2 = s1 - 4 / (2 * n - 1)

print((s1 + s2) / 2)